Revit 2027 API
UIApplication.ProductIsRS Property
 Identifies if the current Revit product has an RS designation. Most add-ins will not need to use this information.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ProductIsRS { get; }
Public ReadOnly Property ProductIsRS As Boolean
	Get
public:
property bool ProductIsRS {
	bool get ();
}
member ProductIsRS : bool with get
Property Value
Boolean
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace